Revit 2027 API
ParameterTypeId.StructuralFamilyNameKey Property
 "Family Name Key"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralFamilyNameKey { get; }
Public Shared ReadOnly Property StructuralFamilyNameKey As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralFamilyNameKey {
	ForgeTypeId^ get ();
}
static member StructuralFamilyNameKey : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace